test/speedtests/artillery.yaml
config:
  ## API1
  #target: 'http://ec2-3-90-239-173.compute-1.amazonaws.com:3000'

  ## API2
  #target: 'http://ec2-34-227-192-223.compute-1.amazonaws.com:3000'

  #LOCALHOST
  target: 'http://localhost:3000'
  phases:
    - duration: 120
      arrivalRate: 100

  payload:
    path: 'ids.csv'
    fields:
      - 'id'

scenarios:
  - name: 'Retrieve data'
    flow:
      - get:
          url: '/products?page={{id}}'
      - get:
          url: '/products/{{id}}/styles'
      - get:
          url: '/products/{{id}}/related'
      - get:
          url: '/products/{{id}}'
      - get:
          url: '/products/{{id}}'
      - get:
          url: '/products/{{id}}'
      - get:
          url: '/products/{{id}}'
