test/speedtests/artillery.yaml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 30
      arrivalRate: 500

scenarios:
  - name: 'Retrieve data'
    flow:
      - get:
          url: '/products'
      - get:
          url: '/products/37831/styles'
      - get:
          url: '/products/37381/related'
      - get:
          url: '/products/37381'
      - get:
          url: '/products/37381'
      - get:
          url: '/products/37381'
      - get:
          url: '/products/37381'
