test/speedtests/artillery.yaml
config:
  target: 'http://ec2-3-90-239-173.compute-1.amazonaws.com:3000'
  phases:
    - duration: 30
      arrivalRate: 250

  payload:
    path: 'ids.csv'
    fields:
      - 'id'

scenarios:
  - name: 'Retrieve data'
    flow:
      - get:
          url: '/products?page={{id}}&count=10'
      - get:
          url: '/products/{{id}}/styles'
      - get:
          url: '/products/{{id}}/related'
      - get:
          url: '/products/{{id}}'
      - get:
          url: '/products/{{id}}'
      - get:
          url: '/products/{{id}}'
      - get:
          url: '/products/{{id}}'
